app/Controllers/UserController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'edgar.degante.a@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $data = [];

        if ($this->request->getMethod() == 'post') {

            $rules = [
                'email' => 'required|min_length[6]|max_length[50]|valid_email',
                'password' => 'required|min_length[3]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => "Correo electrónico o contraseña incorrecta",
                ],
            ];

            if (!$this->validate($rules, $errors)) {

                return redirect()->back()->with('error', 'El correo electrónico no existe o la contraseña es incorrecta.');

                /*
                return view('login', [
                    "validation" => $this->validator,
                ]);
                */

            } else {
                $model = new UsuarioModel();

                $user = $model->where('email', $this->request->getVar('email'))->first();